#+STARTUP: overview
#+TITLE: emacs configuration
#+LANGUAGE: en
#+OPTIONS: num:nil

*** Code
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :defer t
    :commands (pdf-view-mode pdf-tools-install)
    :mode ("\\.[pP][dD][fF]\\'" . pdf-view-mode)
    :load-path "site-lisp/pdf-tools/lisp"
    :magic ("%PDF" . pdf-view-mode)
    :config
    (pdf-tools-install)
    (define-pdf-cache-function pagelabels)
    :hook ((pdf-view-mode-hook . (lambda () (display-line-numbers-mode -1)))
    (pdf-view-mode-hook . pdf-tools-enable-minor-modes)))

  (use-package pdf-view-restore
    :after pdf-tools
    :config
    (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode))

  (use-package org-pdftools
    :hook (org-load-hook . org-pdftools-setup-link))
#+END_SRC

#+RESULTS:
| org-pdftools-setup-link |

